In [2]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

# Object creation

In [3]:
# create series object
series = pd.Series([1, 2, 3, np.nan, 5, 6])

In [4]:
series.head()

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [8]:
# create date range
date = pd.date_range("20180101", periods=10)

In [9]:
date

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10'],
              dtype='datetime64[ns]', freq='D')

In [17]:
# create a dataframe based on date
# 10 rows and 4 columns
# the name of the columns are being specified as A, B, C and D
df = pd.DataFrame(np.random.randn(10, 4), index=date, columns=list('ABCD'))

In [18]:
df.head(10)

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827
2018-01-06  1.184854 -1.697642 -2.827003  1.003650
2018-01-07 -2.345246 -0.362957 -0.173508  0.630733
2018-01-08 -0.194157 -0.074678 -0.708993  0.298545
2018-01-09 -0.168190  2.201710  1.028762 -0.371360
2018-01-10  0.660723  0.270358  1.220855 -0.795305

In [21]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.
new_df = pd.DataFrame({"A": 1,
                       "B": pd.Timestamp('20130102'),
                       "C" : pd.Series(1,index=list(range(4)), dtype="float32"),
                       "D" : np.array([3] * 4, dtype="int32"),
                       "E" : pd.Categorical(["test", "train", "test", "train"])
                      })

In [22]:
new_df.head()

   A          B    C  D      E
0  1 2013-01-02  1.0  3   test
1  1 2013-01-02  1.0  3  train
2  1 2013-01-02  1.0  3   test
3  1 2013-01-02  1.0  3  train

In [23]:
# specify Dataframe datatypes
new_df.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
dtype: object

In [24]:
# display dataframe index
new_df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [25]:
# display dataframe columns
new_df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [26]:
# display dataframe values
new_df.values

array([[1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train']], dtype=object)

In [27]:
# display quick statistic summary of the dataframe
# THIS IS ONLY APPLICABLE FOR NUMERIC DATA
# DOES NOT WORK ON STRINGS OR TEXT!
new_df.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [28]:
# transposing data
new_df.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train

In [36]:
df.head()

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827

In [42]:
# sort by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-01-01  1.810092 -0.813875  0.594284 -0.971203
2018-01-02 -0.094650  0.231959 -1.943509 -1.444651
2018-01-03  1.062297  0.251652 -1.837057 -2.358250
2018-01-04  0.431144  1.819710 -0.121702  1.467373
2018-01-05  2.951827 -1.310121 -0.338809  1.712355
2018-01-06  1.003650 -2.827003 -1.697642  1.184854
2018-01-07  0.630733 -0.173508 -0.362957 -2.345246
2018-01-08  0.298545 -0.708993 -0.074678 -0.194157
2018-01-09 -0.371360  1.028762  2.201710 -0.168190
2018-01-10 -0.795305  1.220855  0.270358  0.660723

In [40]:
# sort by values
df.sort_values(by="C", ascending=True)

                   A         B         C         D
2018-01-06  1.184854 -1.697642 -2.827003  1.003650
2018-01-05  1.712355 -0.338809 -1.310121  2.951827
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-08 -0.194157 -0.074678 -0.708993  0.298545
2018-01-07 -2.345246 -0.362957 -0.173508  0.630733
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-09 -0.168190  2.201710  1.028762 -0.371360
2018-01-10  0.660723  0.270358  1.220855 -0.795305
2018-01-04  1.467373 -0.121702  1.819710  0.431144

# Data selection

In [43]:
# select according to columns
# yields a series
df["A"]

2018-01-01   -0.971203
2018-01-02   -1.444651
2018-01-03   -2.358250
2018-01-04    1.467373
2018-01-05    1.712355
2018-01-06    1.184854
2018-01-07   -2.345246
2018-01-08   -0.194157
2018-01-09   -0.168190
2018-01-10    0.660723
Freq: D, Name: A, dtype: float64

In [44]:
# select according to rows
# get 3 rows
df[0:3]

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297

In [47]:
# select according to dates
df["20180104" : "20180105"]

                   A         B         C         D
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827

In [51]:
# selection by labels
print(date)

df.loc[date[9]]

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10'],
              dtype='datetime64[ns]', freq='D')

A    0.660723
B    0.270358
C    1.220855
D   -0.795305
Name: 2018-01-10 00:00:00, dtype: float64

# Selection by label

In [55]:
# Selecting on a multi-axis by label
df.loc[:, ["A", "D"]]

                   A         D
2018-01-01 -0.971203  1.810092
2018-01-02 -1.444651 -0.094650
2018-01-03 -2.358250  1.062297
2018-01-04  1.467373  0.431144
2018-01-05  1.712355  2.951827
2018-01-06  1.184854  1.003650
2018-01-07 -2.345246  0.630733
2018-01-08 -0.194157  0.298545
2018-01-09 -0.168190 -0.371360
2018-01-10  0.660723 -0.795305

In [57]:
# Showing label slicing, both endpoints are included
df.loc["20180107" : "20180110", ["A", "B"]]

                   A         B
2018-01-07 -2.345246 -0.362957
2018-01-08 -0.194157 -0.074678
2018-01-09 -0.168190  2.201710
2018-01-10  0.660723  0.270358

In [59]:
# Reduction in the dimensions of the returned object
df.loc["20180110", ["A", "B"]]

A    0.660723
B    0.270358
Name: 2018-01-10 00:00:00, dtype: float64

In [63]:
# For getting a scalar value
df.loc["20180110", "B"]

0.27035825366854865

# Selection by position

In [64]:
df.head()

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827

In [65]:
# get data based on the 4th index!
df.iloc[3]

A    1.467373
B   -0.121702
C    1.819710
D    0.431144
Name: 2018-01-04 00:00:00, dtype: float64

In [66]:
# By integer slices, acting similar to numpy/python
# select based on columns and rows
df.iloc[1:3, 1:3]

                   B         C
2018-01-02 -1.943509  0.231959
2018-01-03 -1.837057  0.251652

In [67]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[0, 2, 4], [0, 1]]

                   A         B
2018-01-01 -0.971203  0.594284
2018-01-03 -2.358250 -1.837057
2018-01-05  1.712355 -0.338809

In [69]:
# For slicing rows explicitly
df.iloc[[1, 2, 3], :]

                   A         B         C         D
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-04  1.467373 -0.121702  1.819710  0.431144

# Boolean indexing

In [70]:
df[df.A > 0]

                   A         B         C         D
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827
2018-01-06  1.184854 -1.697642 -2.827003  1.003650
2018-01-10  0.660723  0.270358  1.220855 -0.795305

In [73]:
# Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ["one", "two", "three", "four", "five", "six", "seven", "eight", "nine", "ten"]
df2

                   A         B         C         D      E
2018-01-01 -0.971203  0.594284 -0.813875  1.810092    one
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650    two
2018-01-03 -2.358250 -1.837057  0.251652  1.062297  three
2018-01-04  1.467373 -0.121702  1.819710  0.431144   four
2018-01-05  1.712355 -0.338809 -1.310121  2.951827   five
2018-01-06  1.184854 -1.697642 -2.827003  1.003650    six
2018-01-07 -2.345246 -0.362957 -0.173508  0.630733  seven
2018-01-08 -0.194157 -0.074678 -0.708993  0.298545  eight
2018-01-09 -0.168190  2.201710  1.028762 -0.371360   nine
2018-01-10  0.660723  0.270358  1.220855 -0.795305    ten

In [74]:
# filter by using isin method
df2[df2['E'].isin(["two", "four", "ten"])]

                   A         B         C         D     E
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650   two
2018-01-04  1.467373 -0.121702  1.819710  0.431144  four
2018-01-10  0.660723  0.270358  1.220855 -0.795305   ten

# Missing data

In [80]:
df1 = df.reindex(index=date[0:4], columns=list(df.columns) + ['E'])
df1.loc[date[0]:date[1],'E'] = 1

In [81]:
df1

                   A         B         C         D    E
2018-01-01 -0.971203  0.594284 -0.813875  1.810092  1.0
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650  1.0
2018-01-03 -2.358250 -1.837057  0.251652  1.062297  NaN
2018-01-04  1.467373 -0.121702  1.819710  0.431144  NaN

In [82]:
# To drop any rows that have missing data
df1.dropna(how='any')

                   A         B         C         D    E
2018-01-01 -0.971203  0.594284 -0.813875  1.810092  1.0
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650  1.0

In [83]:
# replace NaN value with 5
df1.fillna(value=5)

                   A         B         C         D    E
2018-01-01 -0.971203  0.594284 -0.813875  1.810092  1.0
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650  1.0
2018-01-03 -2.358250 -1.837057  0.251652  1.062297  5.0
2018-01-04  1.467373 -0.121702  1.819710  0.431144  5.0

In [84]:
# To get the boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      E
2018-01-01  False  False  False  False  False
2018-01-02  False  False  False  False  False
2018-01-03  False  False  False  False   True
2018-01-04  False  False  False  False   True

# Operations

In [86]:
# Operations in general exclude missing data.
df.mean()

A   -0.245639
B   -0.331000
C   -0.128056
D    0.692697
dtype: float64

In [87]:
# Same operation on the other axis
df.mean(1)

2018-01-01    0.154824
2018-01-02   -0.812712
2018-01-03   -0.720339
2018-01-04    0.899131
2018-01-05    0.753813
2018-01-06   -0.584035
2018-01-07   -0.562744
2018-01-08   -0.169821
2018-01-09    0.672731
2018-01-10    0.339158
Freq: D, dtype: float64

In [88]:
df

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827
2018-01-06  1.184854 -1.697642 -2.827003  1.003650
2018-01-07 -2.345246 -0.362957 -0.173508  0.630733
2018-01-08 -0.194157 -0.074678 -0.708993  0.298545
2018-01-09 -0.168190  2.201710  1.028762 -0.371360
2018-01-10  0.660723  0.270358  1.220855 -0.795305

In [91]:
# Operating with objects that have different dimensionality and need alignment. 
# In addition, pandas automatically broadcasts along the specified dimension.
s = pd.Series([1, 3, 5, np.nan, 6, 8, 9, 2, 16, 10], index=date)

In [94]:
s

2018-01-01     1.0
2018-01-02     3.0
2018-01-03     5.0
2018-01-04     NaN
2018-01-05     6.0
2018-01-06     8.0
2018-01-07     9.0
2018-01-08     2.0
2018-01-09    16.0
2018-01-10    10.0
Freq: D, dtype: float64

In [93]:
s.shift(2)

2018-01-01    NaN
2018-01-02    NaN
2018-01-03    1.0
2018-01-04    3.0
2018-01-05    5.0
2018-01-06    NaN
2018-01-07    6.0
2018-01-08    8.0
2018-01-09    9.0
2018-01-10    2.0
Freq: D, dtype: float64

In [95]:
df

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -1.444651 -1.943509  0.231959 -0.094650
2018-01-03 -2.358250 -1.837057  0.251652  1.062297
2018-01-04  1.467373 -0.121702  1.819710  0.431144
2018-01-05  1.712355 -0.338809 -1.310121  2.951827
2018-01-06  1.184854 -1.697642 -2.827003  1.003650
2018-01-07 -2.345246 -0.362957 -0.173508  0.630733
2018-01-08 -0.194157 -0.074678 -0.708993  0.298545
2018-01-09 -0.168190  2.201710  1.028762 -0.371360
2018-01-10  0.660723  0.270358  1.220855 -0.795305

In [97]:
# applying functions to the dataframe
df.apply(np.cumsum)

                   A         B         C         D
2018-01-01 -0.971203  0.594284 -0.813875  1.810092
2018-01-02 -2.415854 -1.349225 -0.581916  1.715442
2018-01-03 -4.774104 -3.186282 -0.330264  2.777739
2018-01-04 -3.306731 -3.307984  1.489446  3.208883
2018-01-05 -1.594376 -3.646793  0.179325  6.160710
2018-01-06 -0.409522 -5.344435 -2.647678  7.164360
2018-01-07 -2.754768 -5.707392 -2.821186  7.795093
2018-01-08 -2.948925 -5.782069 -3.530178  8.093638
2018-01-09 -3.117115 -3.580360 -2.501416  7.722278
2018-01-10 -2.456392 -3.310001 -1.280561  6.926973

In [98]:
df.apply(lambda x: x.max() - x.min())

A    4.070605
B    4.145219
C    4.646714
D    3.747132
dtype: float64

In [101]:
# histogramming
s = pd.Series(np.random.randint(0, 7, size=10))

In [104]:
s

0    5
1    4
2    5
3    6
4    1
5    2
6    1
7    0
8    1
9    3
dtype: int64

In [103]:
s.value_counts()

1    3
5    2
6    1
4    1
3    1
2    1
0    1
dtype: int64

In [114]:
data = pd.DataFrame(["Hello", "World", "Teppanyaki", "Gundam"])

In [115]:
data.head()

            0
0       Hello
1       World
2  Teppanyaki
3      Gundam

In [116]:
# perform lowercase operation on dataframe via lambda
data = data.apply(lambda x: x.astype(str).str.lower())

In [117]:
data

            0
0       hello
1       world
2  teppanyaki
3      gundam

In [118]:
# concatenate
df = pd.DataFrame(np.random.randn(10, 4))

In [119]:
df

          0         1         2         3
0  0.204305  0.639444 -0.292256 -0.206641
1 -0.332826 -1.722560  0.170135 -1.394833
2 -0.207174  0.700051  0.359616 -0.028655
3 -2.196246 -0.136130  0.512558 -1.690898
4 -0.030197  1.482618 -0.186153  0.547073
5 -0.920392 -1.787937 -0.121711  1.790490
6  1.498147 -0.303428  0.145818 -0.326762
7 -0.602170  0.454197 -1.364704  0.329776
8 -0.893920  0.684470  1.742047 -0.193715
9  1.185223  0.398048 -0.353931 -0.916891

In [120]:
# break into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [121]:
pieces

[          0         1         2         3
 0  0.204305  0.639444 -0.292256 -0.206641
 1 -0.332826 -1.722560  0.170135 -1.394833
 2 -0.207174  0.700051  0.359616 -0.028655,
           0         1         2         3
 3 -2.196246 -0.136130  0.512558 -1.690898
 4 -0.030197  1.482618 -0.186153  0.547073
 5 -0.920392 -1.787937 -0.121711  1.790490
 6  1.498147 -0.303428  0.145818 -0.326762,
           0         1         2         3
 7 -0.602170  0.454197 -1.364704  0.329776
 8 -0.893920  0.684470  1.742047 -0.193715
 9  1.185223  0.398048 -0.353931 -0.916891]

In [122]:
pd.concat(pieces)

          0         1         2         3
0  0.204305  0.639444 -0.292256 -0.206641
1 -0.332826 -1.722560  0.170135 -1.394833
2 -0.207174  0.700051  0.359616 -0.028655
3 -2.196246 -0.136130  0.512558 -1.690898
4 -0.030197  1.482618 -0.186153  0.547073
5 -0.920392 -1.787937 -0.121711  1.790490
6  1.498147 -0.303428  0.145818 -0.326762
7 -0.602170  0.454197 -1.364704  0.329776
8 -0.893920  0.684470  1.742047 -0.193715
9  1.185223  0.398048 -0.353931 -0.916891

In [123]:
# join
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [124]:
left

   key  lval
0  foo     1
1  foo     2

In [125]:
right

   key  rval
0  foo     4
1  foo     5

In [126]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [127]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [128]:
left

   key  lval
0  foo     1
1  bar     2

In [129]:
right

   key  rval
0  foo     4
1  bar     5

In [130]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [131]:
# append
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [132]:
df

          A         B         C         D
0 -0.745688 -1.432936  0.483981  0.361916
1  1.551003 -0.051511 -1.809021  1.238444
2  0.183369 -1.966846  1.042212 -2.540104
3 -0.669510  1.119148 -0.213492 -0.159029
4 -0.553074  0.694499  0.735673 -0.137270
5 -1.092884 -0.918838 -0.029373  1.840896
6  0.203708  1.319363  0.129058 -1.300453
7 -1.527218 -0.340930  1.068697 -1.940055

In [133]:
s = df.iloc[0]

In [134]:
s

A   -0.745688
B   -1.432936
C    0.483981
D    0.361916
Name: 0, dtype: float64

In [135]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.745688 -1.432936  0.483981  0.361916
1  1.551003 -0.051511 -1.809021  1.238444
2  0.183369 -1.966846  1.042212 -2.540104
3 -0.669510  1.119148 -0.213492 -0.159029
4 -0.553074  0.694499  0.735673 -0.137270
5 -1.092884 -0.918838 -0.029373  1.840896
6  0.203708  1.319363  0.129058 -1.300453
7 -1.527218 -0.340930  1.068697 -1.940055
8 -0.745688 -1.432936  0.483981  0.361916

# Grouping

In [138]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                  'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                  'C' : np.random.randn(8),
                  'D' : np.random.randn(8)
                  })

In [139]:
df

     A      B         C         D
0  foo    one -1.146792  1.921020
1  bar    one  1.046855  0.466721
2  foo    two -2.319306 -1.637856
3  bar  three -0.373780 -0.631236
4  foo    two -0.105791 -1.607112
5  bar    two  1.876621 -0.900615
6  foo    one  0.007720 -1.225849
7  foo  three  0.028284 -1.002243

In [140]:
# group by A and sum up all the values
df.groupby('A').sum()

            C         D
A
bar  2.549696 -1.065130
foo -3.535884 -3.552041